marcusufg/basic_AWS_MQTT_OTA/sdkconfig.defaults.esp32s2
CONFIG_SPIRAM=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_NOINIT_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_IDF_TARGET="esp32s2"
CONFIG_IDF_TARGET_ESP32=n
CONFIG_IDF_TARGET_ESP32S2=y
